//1Створити розмітку з двома текстовими полями та кнопкою. При натисканні на кнопку перевіряти, чи обидва поля містять значення, якщо так, то виводити повідомлення "Обидва поля заповнені", якщо ні — "Не всі поля заповнені".

// const inpat = prompt("Введіть ім'я");
// const input = prompt("Введіть прізвище");
// if (inpat.length > 0 && input.length > 0) {
//     console.log("Обидва поля заповнені");
// } else {
//     console.log("Не всі поля заповнені");
// }

//2Створити розмітку з двома числовими полями та кнопкою. При натисканні на кнопку перевіряти, чи сума значень полів більша за 10, якщо так, то виводити повідомлення "Сума більша за 10", якщо ні — "Сума менша або дорівнює 10".

// const num = Number(prompt("Введіть число від 1-10"));
// const numb = Number(prompt("Введіть число від 1-10"));
// const result = num + numb;
// if (result > 10) {
//     console.log("Сума більша за 10");
// } else{
//     console.log("Сума менша або дорівнює 10");
    
// }

//3Створити розмітку з текстовим полем та кнопкою. При натисканні на кнопку перевіряти, чи введений текст містить слово "JavaScript", якщо так, то виводити повідомлення "Текст містить слово JavaScript", якщо ні — "Текст не містить слово JavaScript".

// const text = prompt("Введіть щось про себе");
// if (text.toLowerCase().includes("javascript")) {
//     console.log("Текст містить слово JavaScript");
// } else {
//     console.log("Текст не містить слово JavaScript");
// }

//4Створити розмітку з формою з полями введення та кнопкою. При натисканні на кнопку перевіряти, чи введене число більше за 10 та менше за 20, якщо так, то виводити повідомлення "Число входить в діапазон від 10 до 20", якщо ні — "Число не входить в діапазон від 10 до 20".
// const namber = Number(prompt("Введіть число від 1 - 30"))
// if (namber > 9 && namber < 21) {
//     console.log("Число входить в діапазон від 10 до 20");
// } else{
//     console.log("Число не входить в діапазон від 10 до 20");
// }


// 5Створити розмітку з формою з полями введення та кнопкою. При натисканні на кнопку перевіряти, чи введені дані правильно заповнені, якщо так, то перенаправляти на іншу сторінку, якщо ні — виводити повідомлення про помилку. Правильно заповнені дані: ім'я містить не менше 3 символів, email містить символ @ та крапку після неї, пароль містить не менше 6 символів.

const nume = prompt("Введіть ім'я");
const gmail = prompt("Введіть електронну адресу");
const password = prompt("Введіть пароль");
if (nume.length >= 3 && gmail.includes("@")  &&  gmail.includes(".")  && password.length >= 6) {
    alert("Все вірно")
} else {
    alert("Не вірні данні")
}