// 1Вивести в консоль всі числа від 1 до 10 за допомогою циклу while.
// let i = 0;
// while (i <= 10) {
//     console.log(i);
//     i += 1
// }


// 2Вивести в консоль всі парні числа від 2 до 20 за допомогою циклу for. Якщо число парне, пропустити його за допомогою continue.

// for (let i = 0; i <= 20; i += 1) {
//      if (i % 2 !== 0) {
//          continue;
//     }
//     console.log(i);
    
//  }

// 3Вивести в консоль таблицю множення числа 7 за допомогою циклу for.

// let number = 7;
// for (let i = 0; i <= 10; i += 1) {
//     console.log(`${number} x ${i} = ${number * i}`);
// }

// Створити скрипт, який виводить в консоль всі числа , які менші за n. Якщо зустрічається число, що більше або дорівнює n, цикл повинен бути закінчений за допомогою break.

// const n = Number(prompt("Введіть любе число до 100"));
// for (let i = 0; i <= 100 ; i += 1){
//     if (i >= n) {
//         break;
//     }
//     console.log(i);
// }

// За допомогою циклу while вивести в консоль всі числа від 1 до 20, крім чисел, кратних 3. Якщо зустрінете число, кратне 3, цикл повинен продовжити виконання за допомогою оператора continue.
let i = 0;
while (i <= 20) {
    console.log(i);
    i += 1
      if (i % 3 === 0) {
          continue;
     }
}